"use client"

import { useEffect } from "react"

export default function DevToolsMessage() {
  useEffect(() => {
    console.log(
      `
 █████╗ ███████╗██╗     ██████╗ ██████╗ ██████╗ ███████╗
██╔══██╗╚══███╔╝██║    ██╔════╝██╔═══██╗██╔══██╗██╔════╝
███████║  ███╔╝ ██║    ██║     ██║   ██║██║  ██║█████╗  
██╔══██║ ███╔╝  ██║    ██║     ██║   ██║██║  ██║██╔══╝  
██║  ██║███████╗██║    ╚██████╗╚██████╔╝██████╔╝███████╗
╚═╝  ╚═╝╚══════╝╚═╝     ╚═════╝ ╚═════╝ ╚═════╝ ╚══════╝
\n%cProcurando algo? Na página inicial tem....`,
"color: #232323; background: #FCE98B; font-size: 13px; padding: 6px 16px 8px; border-radius: 0 0 4px 4px;"
    )
  }, [])

  return null
}
